# 1.         ℹ `Создайте Series с данными о продажах за неделю [120, 150, 90, 200, 180, 250, 300] (Пн-Вс) и выполните анализ`

In [63]:
# загружаем библиотеки

In [13]:
import pandas as pd

In [240]:
import numpy as np

In [238]:
import matplotlib.pyplot as plt

In [241]:
from matplotlib.ticker import FuncFormatter

In [95]:
sales = pd.Series([120, 150, 90, 200, 180, 250, 300], 
                  index = ["ПН", "ВТ", "СР", "ЧТ", "ПТ", "СБ", "ВС"], 
                  name = "Продажи") # Создан Series с данными о продажах за неделю

## 1А.        ✅`Выведите дни с продажами выше среднего`

In [254]:
sales # Проверка продаж

ПН    120
ВТ    150
СР     90
ЧТ    200
ПТ    180
СБ    250
ВС    300
Name: Продажи, dtype: int64

In [45]:
sales.mean() # Вывод среднего арифметического значения. Получаем среднее по продаж.

np.float64(184.28571428571428)

In [57]:
above_avg = sales[sales > sales.mean()]  # Продажи сравниваем со средним значением и выводим всё, что выше этого значения

In [58]:
print('Дни с продажами выше среднего')
print(above_avg)

Дни с продажами выше среднего
ЧТ    200
СБ    250
ВС    300
Name: Продажи, dtype: int64

## 1Б.        ✅`Найдите процентное соотношение продаж в выходные (Сб, Вс) к общим продажам`

In [118]:
# новая переменная с общей суммой продаж
all_sum_values = sales.sum()

In [119]:
# новая переменная с фильтром продаж по выходным
weeekend_sales = sales[['СБ', 'ВС']].sum()

In [120]:
# процентное соотношение продаж в выходные (Сб, Вс) к общим продажам
percentage = (weeekend_sales/all_sum_values)*100

In [121]:
print('Процентное соотношение продаж в выходные (Сб, Вс) к общим продажам:', '→',percentage,'←')

Процентное соотношение продаж в выходные (Сб, Вс) к общим продажам: → 42.63565891472868 ←

# 2.        ℹ `Очистите DataFrame с "грязными" данными`

In [4]:
data = {
    'Продукт': ['Яблоки', 'Груши', 'Бананы', np.nan, 'Апельсины', ''],
    'Цена': [100, 120, '90', 150, 'не число', 200],
    'Количество': [10, 15, 20, None, 25, 30]
}

## 2А.        ✅`Создание DataFrame с "грязными" данными`

In [11]:
df = pd.DataFrame(data)

In [6]:
print(df)

     Продукт      Цена  Количество
0     Яблоки       100        10.0
1      Груши       120        15.0
2     Бананы        90        20.0
3        NaN       150         NaN
4  Апельсины  не число        25.0
5                  200        30.0

In [28]:
df

      Продукт      Цена  Количество
0      Яблоки       100        10.0
1       Груши       120        15.0
2      Бананы        90        20.0
3  Неизвестно       150         NaN
4   Апельсины  не число        25.0
5  Неизвестно       200        30.0

## 2Б.        ✅`Замените пустые строки и NaN в столбце 'Продукт' на 'Неизвестно'`

In [50]:
df ['Продукт'] = df ['Продукт'].replace(['', np.nan], 'Неизвестно') # Заменяем значение NaN в колонке Продукты на "Неизвестно"

In [26]:
df

      Продукт      Цена  Количество
0      Яблоки       100        10.0
1       Груши       120        15.0
2      Бананы        90        20.0
3  Неизвестно       150         NaN
4   Апельсины  не число        25.0
5  Неизвестно       200        30.0

In [48]:
df.info

<bound method DataFrame.info of       Продукт   Цена  Количество
0      Яблоки  100.0        10.0
1       Груши  120.0        15.0
2      Бананы   90.0        20.0
3  Неизвестно  150.0         NaN
4   Апельсины    NaN        25.0
5  Неизвестно  200.0        30.0>

## 2Б.        ✅`Преобразуйте столбец 'Цена' в числовой формат, ошибки замените на NaN`

In [42]:
df ['Цена'] = pd.to_numeric(df ['Цена'], errors = 'coerce')

In [52]:
df

      Продукт   Цена  Количество
0      Яблоки  100.0        10.0
1       Груши  120.0        15.0
2      Бананы   90.0        20.0
3  Неизвестно  150.0         NaN
4   Апельсины    NaN        25.0
5  Неизвестно  200.0        30.0

## 2Г.        ✅`Заполните пропущенные значения в 'Количество' средним значением`

In [44]:
mean_qty = df['Количество'].mean() # вывод количетсво

In [56]:
mean_qty

np.float64(20.0)

In [57]:
df['Количество'] = df['Количество'].fillna(mean_qty)

In [58]:
df

      Продукт   Цена  Количество
0      Яблоки  100.0        10.0
1       Груши  120.0        15.0
2      Бананы   90.0        20.0
3  Неизвестно  150.0        20.0
4   Апельсины    NaN        25.0
5  Неизвестно  200.0        30.0

## 2Д.        ✅`Удалите строки, где цена не указана (NaN)`

In [60]:
df = df.dropna(subset = 'Цена')

In [61]:
df

      Продукт   Цена  Количество
0      Яблоки  100.0        10.0
1       Груши  120.0        15.0
2      Бананы   90.0        20.0
3  Неизвестно  150.0        20.0
5  Неизвестно  200.0        30.0

# 3.        ℹ `Проанализируйте простой набор данных о фруктах и их ценах.`

In [64]:
data = {
    'Фрукт': ['Яблоко', 'Банан', 'Апельсин', 'Груша', 'Киви'],
    'Цена': [80, 60, 90, 70, 120],
    'Наличие_кг': [15, 8, 12, 5, 3]
}

In [66]:
df = pd.DataFrame(data)

In [68]:
df # check

      Фрукт  Цена  Наличие_кг
0    Яблоко    80          15
1     Банан    60           8
2  Апельсин    90          12
3     Груша    70           5
4      Киви   120           3

## 3А.        ✅`Выведите только фрукты дороже 75 рублей`

In [71]:
fruits = df[df['Цена'] > 75]

In [72]:
fruits # check

      Фрукт  Цена  Наличие_кг
0    Яблоко    80          15
2  Апельсин    90          12
4      Киви   120           3

## 3Б.        ✅`Посчитайте общую стоимость всех имеющихся фруктов`

In [75]:
df['Стоимость'] = df['Цена'] = df['Наличие_кг']

In [78]:
df #check

      Фрукт  Цена  Наличие_кг  Стоимость
0    Яблоко    15          15         15
1     Банан     8           8          8
2  Апельсин    12          12         12
3     Груша     5           5          5
4      Киви     3           3          3

In [81]:
total = df['Стоимость'].sum()

In [82]:
total

np.int64(43)

## 3В.        ✅`Добавьте новый фрукт (Манго за 100 руб., 7 кг)`

In [85]:
New_fruits = pd.DataFrame({ 
    'Фрукт': ['Манго'],
    'Цена': [100],
    'Наличие_кг': [7],
    'Стоимость': [700]
})

In [87]:
df #check

      Фрукт  Цена  Наличие_кг  Стоимость
0    Яблоко    15          15         15
1     Банан     8           8          8
2  Апельсин    12          12         12
3     Груша     5           5          5
4      Киви     3           3          3

In [92]:
df = pd.concat([df, New_fruits], ignore_index = True) # Объединение двух df

In [93]:
df

      Фрукт  Цена  Наличие_кг  Стоимость
0    Яблоко    15          15         15
1     Банан     8           8          8
2  Апельсин    12          12         12
3     Груша     5           5          5
4      Киви     3           3          3
5     Манго   100           7        700
6     Манго   100           7        700

## 3Г.        ✅`Отсортируйте фрукты по цене (от дешевых к дорогим)`

In [94]:
df.sort_values('Цена')

      Фрукт  Цена  Наличие_кг  Стоимость
4      Киви     3           3          3
3     Груша     5           5          5
1     Банан     8           8          8
2  Апельсин    12          12         12
0    Яблоко    15          15         15
5     Манго   100           7        700
6     Манго   100           7        700

# 4.        ℹ `Исследование заёмщиков`

**Заказчик** - Кредитный отдел банка.

Согласно документации к данным:
* `children` — количество детей в семье;
* `days_employed` — общий трудовой стаж в днях;
* `dob_years` — возраст клиента в годах;
* `education` — уровень образования клиента;
* `education_id` — идентификатор уровня образования;
* `family_status` — семейное положение;
* `family_status_id` — идентификатор семейного положения;
* `gender` — пол клиента;
* `income_type` — тип занятости;
* `debt` — имел ли задолженность по возврату кредитов;
* `total_income` — ежемесячный доход;
* `purpose` — цель получения кредита.

ℹ **Дать ответы на вопросы:**

* 4А.   ❓`Средняя зарплата по типу занятости`;
 
* 4Б.   ❓`Процент заемщиков с высшим образованием`;
  
* 4В.   ❓`Частота кредитов на покупку жилья`;
  
* 4Г.   ❓`Зависимость между семейным положением и задолженностью`;
  
* 4Д.   ❓`Есть ли зависимость между количеством детей и возвратом кредита в срок?`;
  
* 4Е.   ❓`Есть ли зависимость между уровнем дохода и возвратом кредита в срок?`.

## ✅ Обзор данных

In [153]:
df = pd.read_csv("data.csv")

In [154]:
df

,Unnamed: 0,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,2,0,5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,4,0,1630.019381,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу
...,...,...,...,...,...,...,...,...,...,...,...,...,...
21390,21390,1,4529.316663,43,среднее,1,гражданский брак,1,F,компаньон,0,224791.862382,операции с жильем
21391,21391,0,1630.019381,67,среднее,1,женат / замужем,0,F,пенсионер,0,155999.806512,сделка с автомобилем
21392,21392,1,2113.346888,38,среднее,1,гражданский брак,1,M,сотрудник,1,89672.561153,недвижимость
21393,21393,3,3112.481705,38,среднее,1,женат / замужем,0,M,сотрудник,1,244093.050500,на покупку своего автомобиля
21394,21394,2,1984.507589,40,среднее,1,женат / замужем,0,F,сотрудник,0,82047.418899,на покупку автомобиля

In [155]:
df.head(2) # output 2 lines

,Unnamed: 0,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля

In [156]:
df.info #check general info

<bound method DataFrame.info of        Unnamed: 0  children  days_employed  dob_years education  education_id  \
0               0         1    8437.673028         42    высшее             0
1               1         1    4024.803754         36   среднее             1
2               2         0    5623.422610         33   Среднее             1
3               3         3    4124.747207         32   среднее             1
4               4         0    1630.019381         53   среднее             1
...           ...       ...            ...        ...       ...           ...
21390       21390         1    4529.316663         43   среднее             1
21391       21391         0    1630.019381         67   среднее             1
21392       21392         1    2113.346888         38   среднее             1
21393       21393         3    3112.481705         38   среднее             1
21394       21394         2    1984.507589         40   среднее             1

          family_status  family_status_id gender income_type  debt  \
0       женат / замужем                 0      F   сотрудник     0
1       женат / замужем                 0      F   сотрудник     0
2       женат / замужем                 0      M   сотрудник     0
3       женат / замужем                 0      M   сотрудник     0
4      гражданский брак                 1      F   пенсионер     0
...                 ...               ...    ...         ...   ...
21390  гражданский брак                 1      F   компаньон     0
21391   женат / замужем                 0      F   пенсионер     0
21392  гражданский брак                 1      M   сотрудник     1
21393   женат / замужем                 0      M   сотрудник     1
21394   женат / замужем                 0      F   сотрудник     0

        total_income                       purpose
0      253875.639453                 покупка жилья
1      112080.014102       приобретение автомобиля
2      145885.952297                 покупка жилья
3      267628.550329    дополнительное образование
4      158616.077870               сыграть свадьбу
...              ...                           ...
21390  224791.862382             операции с жильем
21391  155999.806512          сделка с автомобилем
21392   89672.561153                  недвижимость
21393  244093.050500  на покупку своего автомобиля
21394   82047.418899         на покупку автомобиля

[21395 rows x 13 columns]>

In [157]:
df.describe()

,Unnamed: 0,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21395.000000,21395.000000,19284.000000,21395.000000,21395.000000,21395.000000,21395.000000,1.928400e+04
mean,10697.000000,0.470437,2224.761599,43.284272,0.817107,0.974246,0.081000,1.674178e+05
std,6176.348841,0.754534,2106.974155,12.576030,0.548879,1.421282,0.272842,1.030418e+05
min,0.000000,-1.000000,24.141633,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,5348.500000,0.000000,927.984311,33.000000,1.000000,0.000000,0.000000,1.030161e+05
50%,10697.000000,0.000000,1630.019381,42.000000,1.000000,0.000000,0.000000,1.450208e+05
75%,16045.500000,1.000000,2747.876441,53.000000,1.000000,1.000000,0.000000,2.033700e+05
max,21394.000000,5.000000,18388.949901,75.000000,4.000000,4.000000,1.000000,2.265604e+06

In [158]:
df['education'].unique() # checking for duplicates

array(['высшее', 'среднее', 'Среднее', 'СРЕДНЕЕ', 'ВЫСШЕЕ',
       'неоконченное высшее', 'начальное', 'Высшее',
       'НЕОКОНЧЕННОЕ ВЫСШЕЕ', 'Неоконченное высшее', 'НАЧАЛЬНОЕ',
       'Начальное', 'Ученая степень', 'УЧЕНАЯ СТЕПЕНЬ', 'ученая степень'],
      dtype=object)

In [159]:
df['education'].value_counts()  # подсчет количества людей и образование

education
среднее                13653
высшее                  4698
СРЕДНЕЕ                  770
Среднее                  705
неоконченное высшее      666
ВЫСШЕЕ                   271
Высшее                   268
начальное                250
Неоконченное высшее       47
НЕОКОНЧЕННОЕ ВЫСШЕЕ       29
НАЧАЛЬНОЕ                 17
Начальное                 15
ученая степень             4
Ученая степень             1
УЧЕНАЯ СТЕПЕНЬ             1
Name: count, dtype: int64

In [160]:
for i in ['education', 'family_status', 'gender', 'income_type', 'purpose']: # цикл для проверки на уникльность
    print(df[i].unique())

['высшее' 'среднее' 'Среднее' 'СРЕДНЕЕ' 'ВЫСШЕЕ' 'неоконченное высшее'
 'начальное' 'Высшее' 'НЕОКОНЧЕННОЕ ВЫСШЕЕ' 'Неоконченное высшее'
 'НАЧАЛЬНОЕ' 'Начальное' 'Ученая степень' 'УЧЕНАЯ СТЕПЕНЬ'
 'ученая степень']
['женат / замужем' 'гражданский брак' 'вдовец / вдова' 'в разводе'
 'не женат / не замужем']
['F' 'M' 'XNA']
['сотрудник' 'пенсионер' 'компаньон' 'госслужащий' 'безработный'
 'предприниматель' 'студент' 'в декрете']
['покупка жилья' 'приобретение автомобиля' 'дополнительное образование'
 'сыграть свадьбу' 'операции с жильем' 'образование'
 'на проведение свадьбы' 'покупка жилья для семьи' 'покупка недвижимости'
 'покупка коммерческой недвижимости' 'покупка жилой недвижимости'
 'строительство собственной недвижимости' 'недвижимость'
 'строительство недвижимости' 'на покупку подержанного автомобиля'
 'на покупку своего автомобиля' 'операции с коммерческой недвижимостью'
 'строительство жилой недвижимости' 'жилье'
 'операции со своей недвижимостью' 'автомобили' 'заняться образованием'
 'сделка с подержанным автомобилем' 'получение образования' 'автомобиль'
 'свадьба' 'получение дополнительного образования' 'покупка своего жилья'
 'операции с недвижимостью' 'получение высшего образования'
 'свой автомобиль' 'сделка с автомобилем' 'профильное образование'
 'высшее образование' 'покупка жилья для сдачи' 'на покупку автомобиля'
 'ремонт жилью' 'заняться высшим образованием']

In [161]:
df = df.drop(columns = ['Unnamed: 0']) # удаление ненужного столбца

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21395 entries, 0 to 21394
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21395 non-null  int64
 1   days_employed     19284 non-null  float64
 2   dob_years         21395 non-null  int64
 3   education         21395 non-null  object
 4   education_id      21395 non-null  int64
 5   family_status     21395 non-null  object
 6   family_status_id  21395 non-null  int64
 7   gender            21395 non-null  object
 8   income_type       21395 non-null  object
 9   debt              21395 non-null  int64
 10  total_income      19284 non-null  float64
 11  purpose           21395 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [163]:
df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21395.000000,19284.000000,21395.000000,21395.000000,21395.000000,21395.000000,1.928400e+04
mean,0.470437,2224.761599,43.284272,0.817107,0.974246,0.081000,1.674178e+05
std,0.754534,2106.974155,12.576030,0.548879,1.421282,0.272842,1.030418e+05
min,-1.000000,24.141633,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,0.000000,927.984311,33.000000,1.000000,0.000000,0.000000,1.030161e+05
50%,0.000000,1630.019381,42.000000,1.000000,0.000000,0.000000,1.450208e+05
75%,1.000000,2747.876441,53.000000,1.000000,1.000000,0.000000,2.033700e+05
max,5.000000,18388.949901,75.000000,4.000000,4.000000,1.000000,2.265604e+06

## ✅ Предобработка данных
Что входит в перечень задач по очистке данных?
* `Очистка явных и неявных дубликатов`;
* `Аномальные значения`;
* `Пропустки`;
* `Опечатки`.

In [164]:
df.duplicated().sum()

np.int64(0)

In [165]:
# Удалить дубликаты, если они есть:
df = df.drop_duplicates()

In [185]:
# Уникальные значения в исполнение цикла:

for i in ['education', 'family_status', 'gender', 'income_type', 'purpose']:
    print(df[i].unique())

['высшее' 'среднее' 'неоконченное высшее' 'начальное' 'ученая степень']
['женат / замужем' 'гражданский брак' 'вдовец / вдова' 'в разводе'
 'не женат / не замужем']
['F' 'M']
['сотрудник' 'пенсионер' 'компаньон' 'госслужащий' 'безработный'
 'предприниматель' 'студент' 'в декрете']
['покупка жилья' 'приобретение автомобиля' 'дополнительное образование'
 'сыграть свадьбу' 'операции с жильем' 'образование'
 'на проведение свадьбы' 'покупка жилья для семьи' 'покупка недвижимости'
 'покупка коммерческой недвижимости' 'покупка жилой недвижимости'
 'строительство собственной недвижимости' 'недвижимость'
 'строительство недвижимости' 'на покупку подержанного автомобиля'
 'на покупку своего автомобиля' 'операции с коммерческой недвижимостью'
 'строительство жилой недвижимости' 'жилье'
 'операции со своей недвижимостью' 'автомобили' 'заняться образованием'
 'сделка с подержанным автомобилем' 'получение образования' 'автомобиль'
 'свадьба' 'получение дополнительного образования' 'покупка своего жилья'
 'операции с недвижимостью' 'получение высшего образования'
 'свой автомобиль' 'сделка с автомобилем' 'профильное образование'
 'высшее образование' 'покупка жилья для сдачи' 'на покупку автомобиля'
 'ремонт жилью' 'заняться высшим образованием']

In [167]:
# Группировка по параметру "Дети"
print(df.groupby('children')["children"].count())

children
-1       47
 0    14107
 1     4809
 2     2052
 3      330
 4       41
 5        9
Name: children, dtype: int64

In [168]:
# Группировка по параметру "Дети"

df['children'].value_counts()

children
 0    14107
 1     4809
 2     2052
 3      330
-1       47
 4       41
 5        9
Name: count, dtype: int64

In [169]:
# Сортировка результата выдачи "1." от большего к меньшему по параметру "Кол-во детей": 

df["children"] = df["children"].replace(-1, 1)

In [170]:
# Процентное соотношение детей < 18 лет

print (df[df['dob_years']<18]['dob_years'].count()/df['dob_years'].count()*100)

0.4673989249824725

In [171]:
ndf = df[df['dob_years'] >= 18]

In [172]:
df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21395.000000,19284.000000,21395.000000,21395.000000,21395.000000,21395.000000,1.928400e+04
mean,0.474831,2224.761599,43.284272,0.817107,0.974246,0.081000,1.674178e+05
std,0.751776,2106.974155,12.576030,0.548879,1.421282,0.272842,1.030418e+05
min,0.000000,24.141633,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,0.000000,927.984311,33.000000,1.000000,0.000000,0.000000,1.030161e+05
50%,0.000000,1630.019381,42.000000,1.000000,0.000000,0.000000,1.450208e+05
75%,1.000000,2747.876441,53.000000,1.000000,1.000000,0.000000,2.033700e+05
max,5.000000,18388.949901,75.000000,4.000000,4.000000,1.000000,2.265604e+06

In [174]:
# Привести все данные в нижний регистр

df['education'] = df['education'].str.lower()

In [179]:
# Уникальные значения по гендеру

df['gender'].value_counts()

gender
F    14142
M     7252
Name: count, dtype: int64

In [178]:
# Удаляем из гендера значение "Н/Д"

df = df[df['gender']!='XNA']

In [186]:
def purposes(reason):
    if 'образов' in reason:
        return 'образование'
    if 'свадь' in reason:
        return 'свадьба'
    if 'авто' in reason:
        return 'автомобиль'
    if 'жиль' in reason:
        return 'недвижимость'
    if 'недвиж' in reason:
        return 'недвижимость'

In [187]:
purposes('покупка жилья')

'недвижимость'

In [188]:
df['purposes_category'] = df['purpose'].apply(purposes)

In [194]:
df.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,purposes_category
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья,недвижимость
1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля,автомобиль
2,0,5623.422610,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья,недвижимость
3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование,образование
4,0,1630.019381,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу,свадьба
5,0,926.185831,27,высшее,0,гражданский брак,1,M,компаньон,0,255763.565419,покупка жилья,недвижимость
6,0,2879.202052,43,высшее,0,женат / замужем,0,F,компаньон,0,240525.971920,операции с жильем,недвижимость
7,0,152.779569,50,среднее,1,женат / замужем,0,M,сотрудник,0,135823.934197,образование,образование
8,2,6929.865299,35,высшее,0,гражданский брак,1,F,сотрудник,0,95856.832424,на проведение свадьбы,свадьба
9,0,2188.756445,41,среднее,1,женат / замужем,0,M,сотрудник,0,144425.938277,покупка жилья для семьи,недвижимость

In [191]:
# Проверка: Уникальных значений:

for i in ['education', 'family_status', 'gender', 'income_type', 'purposes_category']:
    print(df[i].unique())

['высшее' 'среднее' 'неоконченное высшее' 'начальное' 'ученая степень']
['женат / замужем' 'гражданский брак' 'вдовец / вдова' 'в разводе'
 'не женат / не замужем']
['F' 'M']
['сотрудник' 'пенсионер' 'компаньон' 'госслужащий' 'безработный'
 'предприниматель' 'студент' 'в декрете']
['недвижимость' 'автомобиль' 'образование' 'свадьба']

In [242]:
df.isna().sum()

children             0
days_employed        0
dob_years            0
education            0
education_id         0
family_status        0
family_status_id     0
gender               0
income_type          0
debt                 0
total_income         0
purpose              0
purposes_category    0
dtype: int64

In [216]:
# Поиск и замена значений в заданном диапазоне

df['days_employed'] = df['days_employed'].fillna(df['days_employed'].median())

In [218]:
df

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,purposes_category,purposes_caterogy
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья,недвижимость,недвижимость
1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля,автомобиль,автомобиль
2,0,5623.422610,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья,недвижимость,недвижимость
3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование,образование,образование
4,0,1630.019381,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу,свадьба,свадьба
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21390,1,4529.316663,43,среднее,1,гражданский брак,1,F,компаньон,0,224791.862382,операции с жильем,недвижимость,недвижимость
21391,0,1630.019381,67,среднее,1,женат / замужем,0,F,пенсионер,0,155999.806512,сделка с автомобилем,автомобиль,автомобиль
21392,1,2113.346888,38,среднее,1,гражданский брак,1,M,сотрудник,1,89672.561153,недвижимость,недвижимость,недвижимость
21393,3,3112.481705,38,среднее,1,женат / замужем,0,M,сотрудник,1,244093.050500,на покупку своего автомобиля,автомобиль,автомобиль
21394,2,1984.507589,40,среднее,1,женат / замужем,0,F,сотрудник,0,82047.418899,на покупку автомобиля,автомобиль,автомобиль

In [243]:
# Цикл
# Поиск и замена пустых значений в заданном диапазоне

for i in df['income_type'].unique():
    df.loc[(df['income_type'] == i) & (df['total_income'].isna()), 'total_income'] = df.loc[(df['income_type'] == i), 'total_income'].median()

In [244]:
df.duplicated().sum() # Проверка на наличие дубликатов

np.int64(0)

In [245]:
df = df.drop_duplicates() # Удаление дубликатов, если они есть

In [246]:
df.head() # Обнаружен дубликат столбца "purposes_caterogy"

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,purposes_category
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья,недвижимость
1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля,автомобиль
2,0,5623.422610,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья,недвижимость
3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование,образование
4,0,1630.019381,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу,свадьба

In [236]:
# df = df.drop(columns='purposes_caterogy')
# print(df)

In [249]:
df.head(1) # Check

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,purposes_category
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья,недвижимость

## Ответы на вопросы

### 4А.        ✅`Средняя зарплата по типу занятости`

In [255]:
avg_income_by_type = df.groupby('income_type')['total_income'].mean()
print('Средняя зарплата по типу занятости: ', avg_income_by_type)

Средняя зарплата по типу занятости:  income_type
безработный        131339.751676
в декрете           53829.130729
госслужащий        168811.737769
компаньон          199558.373308
пенсионер          135266.515670
предприниматель    499163.144947
сотрудник          159533.471972
студент             98201.625314
Name: total_income, dtype: float64

### 4Б.        ✅`Процент заемщиков с высшим образованием`

In [257]:
percent = df.groupby('education')['education'].count()/len(df)*100
percent

education
высшее                 24.493615
начальное               1.319175
неоконченное высшее     3.466342
среднее                70.692801
ученая степень          0.028068
Name: education, dtype: float64

In [258]:
print('Процент заемщиков с высшим образованием:', df[df['education'] == 'высшее']['education'].count()/df.shape[0]*100)

Процент заемщиков с высшим образованием: 24.493614632549

### 4В.        ✅`Частота кредитов на покупку жилья`

In [259]:
percent_category = df[df['purposes_category'] == 'недвижимость']['purposes_category'].count()/len(df)*100
print('Частота кредитов на покупку жилья', percent_category)

Частота кредитов на покупку жилья 50.39996257660102

### 4Г.        ✅`Зависимость между семейным положением и задолженностью`

In [260]:
family_debt = df.groupby('family_status')['debt'].mean().sort_values(ascending=False)
print("Доля должников по семейному положению:")
print((family_debt * 100).round(1))

Доля должников по семейному положению:
family_status
не женат / не замужем    9.7
гражданский брак         9.3
женат / замужем          7.6
в разводе                7.0
вдовец / вдова           6.6
Name: debt, dtype: float64

### 4Д.        ✅`Есть ли зависимость между количеством детей и возвратом кредита в срок?`

In [264]:
children_debt = df.groupby('children')['debt'].mean().sort_values(ascending=False)
print("\nДоля должников по количеству детей:")
print((children_debt * 100).round(1))

Доля должников по количеству детей:
children
4    9.8
2    9.5
1    9.2
3    8.2
0    7.5
5    0.0
Name: debt, dtype: float64

#### 4Д.         Выводы

1. 0 детей: 7.5% должников
2. 1 ребенок: 9.2% должников
3. 2 детей: 9.5% должников
4. 3 детей: 8.2% должников 🔴 Неожиданное снижение
5. 4 детей: 9.8% должников 🔴 МАКСИМАЛЬНЫЙ РИСК
6. 5 детей: 0.0% должников 🔴 МИНИМАЛЬНЫЙ РИСК (аномалия)

⚠ Зависимость существует, но она сложная и требует дополнительного исследования аномалий, особенно для 3 и 5 детей.

### 4Е.        ✅`Есть ли зависимость между уровнем дохода и возвратом кредита в срок?`

In [263]:
df['income_quartile'] = pd.qcut(df['total_income'], 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
income_debt = df.groupby('income_quartile')['debt'].mean()
print("\nДоля должников по квартилям дохода:")
print((income_debt * 100).round(1))

Доля должников по квартилям дохода:
income_quartile
Q1    8.0
Q2    8.8
Q3    8.5
Q4    7.1
Name: debt, dtype: float64

C:\Users\Станислав\AppData\Local\Temp\ipykernel_30576\1315253979.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  income_debt = df.groupby('income_quartile')['debt'].mean()

#### 4Е.         Выводы

Зависимость есть